// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
// a = 5; b = 7 -> max = 7
// a = 2 b = 10 -> max = 10
// a = -9 b = -3 -> max = -3
Console.WriteLine("Введите первое число");
int number1 = int.Parse(Console.ReadLine());
Console.WriteLine("Введите второе число");
int number2 = int.Parse(Console.ReadLine());
if (number1>number2)
{
    Console.WriteLine("Наибольшее число первое = " + number1 + " и наименьшее число второе = " + number2);
}
else
{
   Console.WriteLine("Наибольшее число второе = " + number2 + " и наименьшее число первое = " + number1); 
}



// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
// 2, 3, 7 -> 7
// 44 5 78 -> 78
// 22 3 9 -> 22
Console.WriteLine("Введите первое число");
int number0 = int.Parse(Console.ReadLine());
Console.WriteLine("Введите второе число");
int number1 = int.Parse(Console.ReadLine());
Console.WriteLine("Введите третье число");
int number2 = int.Parse(Console.ReadLine());
int max = 0;
if(number0 > max)
{
    max = number0;
}
if(number1 > max)
{
    max = number1;
}
if(number2 > max)
{
    max = number2;
}
Console.WriteLine("Наибольшее число  = " + max);


// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
// 4 -> да
// -3 -> нет
// 7 -> нет
Console.Write("Введите число: ");
int number = int.Parse(Console.ReadLine());
int result = number % 2; 
if (result == 0)
{
    Console.WriteLine("Число четное");
}
else
{
    Console.WriteLine("Число нечетно");
}


// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
// 5 -> 2, 4
// 8 -> 2, 4, 6, 8
Console.Write("Введите число: ");
int number = int.Parse(Console.ReadLine());
int even = 2;
if (number>1)
{
    while (even<=number)
    {
        Console.Write(even + " ");
        even = even + 2;
    }
}
else 
{
   Console.Write("Некорректный ввод данных"); 
}
